Lray/u5a9_lvgl/u5a9_lvgl.ioc
#MicroXplorer Configuration settings - do not modify
CAD.formats=[]
CAD.pinconfig=Dual
CAD.provider=
CORTEX_M33_NS.userName=CORTEX_M33
DMA2D.IPParameters=InputAlphaForeground,OutputOffset
DMA2D.IPParametersWithoutCheck=OutputOffset
DMA2D.InputAlphaForeground=0xFF
DMA2D.OutputOffset=0
DSIHOST.ClockLaneHS2LPTime=11
DSIHOST.ClockLaneLP2HSTime=40
DSIHOST.DataLaneHS2LPTime=12
DSIHOST.DataLaneLP2HSTime=23
DSIHOST.FrameBTAAcknowledgeEnable=DSI_FBTAA_ENABLE
DSIHOST.IPParameters=ClockLaneHS2LPTime,ClockLaneLP2HSTime,DataLaneHS2LPTime,DataLaneLP2HSTime,StopWaitTime,PLLVCORange,NumberOfLanes,LPHorizontalFrontPorchEnable,LPHorizontalBackPorchEnable,LPVerticalActiveEnable,LPVerticalFrontPorchEnable,LPVerticalBackPorchEnable,LPVerticalSyncActiveEnable,Mode,FrameBTAAcknowledgeEnable,PHYFrequencyRange
DSIHOST.IPParametersWithoutCheck=PacketSize
DSIHOST.LPHorizontalBackPorchEnable=DSI_LP_HBP_ENABLE
DSIHOST.LPHorizontalFrontPorchEnable=DSI_LP_HFP_ENABLE
DSIHOST.LPVerticalActiveEnable=DSI_LP_VACT_ENABLE
DSIHOST.LPVerticalBackPorchEnable=DSI_LP_VBP_ENABLE
DSIHOST.LPVerticalFrontPorchEnable=DSI_LP_VFP_ENABLE
DSIHOST.LPVerticalSyncActiveEnable=DSI_LP_VSYNC_ENABLE
DSIHOST.Mode=DSI_VID_MODE_BURST
DSIHOST.NumberOfLanes=DSI_TWO_DATA_LANES
DSIHOST.PHYFrequencyRange=DSI_DPHY_FRANGE_450MHZ_510MHZ
DSIHOST.PLLVCORange=DSI_DPHY_VCO_FRANGE_800MHZ_1GHZ
DSIHOST.StopWaitTime=7
DSI_CKN.Mode=DSIHost_Video
DSI_CKN.Signal=DSIHOST_CKN
DSI_CKP.Mode=DSIHost_Video
DSI_CKP.Signal=DSIHOST_CKP
DSI_D0N.Mode=DSIHost_Video
DSI_D0N.Signal=DSIHOST_D0N
DSI_D0P.Mode=DSIHost_Video
DSI_D0P.Signal=DSIHOST_D0P
DSI_D1N.Mode=DSIHost_Video
DSI_D1N.Signal=DSIHOST_D1N
DSI_D1P.Mode=DSIHost_Video
DSI_D1P.Signal=DSIHOST_D1P
File.Version=6
GFXMMU.Buf0Address=0x20000000
GFXMMU.Buf1Address=0x201A0000
GFXMMU.CacheActivation=DISABLE
GFXMMU.GFXMMU_AHB_MASTER_ERROR_IT=Enable
GFXMMU.GFXMMU_BUFFER0_OVERFLOW_IT=Enable
GFXMMU.GFXMMU_BUFFER1_OVERFLOW_IT=Enable
GFXMMU.GFXMMUtable=1/216/263,2/208/271,3/200/279,4/196/283,5/188/291,6/184/295,7/180/299,8/176/303,9/172/307,10/168/311,11/168/311,12/164/315,13/160/319,14/156/323,15/156/323,16/152/327,17/148/331,18/148/331,19/144/335,20/144/335,21/140/339,22/136/343,23/136/343,24/132/347,25/132/347,26/128/351,27/128/351,28/124/355,29/124/355,30/120/359,31/120/359,32/120/359,33/116/363,34/116/363,35/112/367,36/112/367,37/108/371,38/108/371,39/108/371,40/104/375,41/104/375,42/104/375,43/100/379,44/100/379,45/100/379,46/96/383,47/96/383,48/96/387,49/92/387,50/92/387,51/92/387,52/88/391,53/88/391,54/88/391,55/84/395,56/84/395,57/84/395,58/80/399,59/80/399,60/80/399,61/80/399,62/76/403,63/76/403,64/76/403,65/72/407,66/72/407,67/72/407,68/72/407,69/68/411,70/68/411,71/68/411,72/68/411,73/64/415,74/64/415,75/64/415,76/64/415,77/60/419,78/60/419,79/60/419,80/60/419,81/60/419,82/56/423,83/56/423,84/56/423,85/56/423,86/52/427,87/52/427,88/52/427,89/52/427,90/52/427,91/48/431,92/48/431,93/48/431,94/48/431,95/48/431,96/48/435,97/44/435,98/44/435,99/44/435,100/44/435,101/44/435,102/40/439,103/40/439,104/40/439,105/40/439,106/40/439,107/40/439,108/36/443,109/36/443,110/36/443,111/36/443,112/36/443,113/36/443,114/32/447,115/32/447,116/32/447,117/32/447,118/32/447,119/32/447,120/32/447,121/28/451,122/28/451,123/28/451,124/28/451,125/28/451,126/28/451,127/28/451,128/24/455,129/24/455,130/24/455,131/24/455,132/24/455,133/24/455,134/24/455,135/24/455,136/20/459,137/20/459,138/20/459,139/20/459,140/20/459,141/20/459,142/20/459,143/20/459,144/20/459,145/16/463,146/16/463,147/16/463,148/16/463,149/16/463,150/16/463,151/16/463,152/16/463,153/16/463,154/12/467,155/12/467,156/12/467,157/12/467,158/12/467,159/12/467,160/12/467,161/12/467,162/12/467,163/12/467,164/12/467,165/12/467,166/8/471,167/8/471,168/8/471,169/8/471,170/8/471,171/8/471,172/8/471,173/8/471,174/8/471,175/8/471,176/8/471,177/8/471,178/8/471,179/4/475,180/4/475,181/4/475,182/4/475,183/4/475,184/4/475,185/4/475,186/4/475,187/4/475,188/4/475,189/4/475,190/4/475,191/4/475,192/4/475,193/4/475,194/4/475,195/4/475,196/4/475,197/0/479,198/0/479,199/0/479,200/0/479,201/0/479,202/0/479,203/0/479,204/0/479,205/0/479,206/0/479,207/0/479,208/0/479,209/0/479,210/0/479,211/0/479,212/0/479,213/0/479,214/0/479,215/0/479,216/0/479,217/0/479,218/0/479,219/0/479,220/0/479,221/0/479,222/0/479,223/0/479,224/0/479,225/0/479,226/0/479,227/0/479,228/0/479,229/0/479,230/0/479,231/0/479,232/0/479,233/0/479,234/0/479,235/0/479,236/0/479,237/0/479,238/0/479,239/0/479,240/0/479,241/0/483,242/0/479,243/0/479,244/0/479,245/0/479,246/0/479,247/0/479,248/0/479,249/0/479,250/0/479,251/0/479,252/0/479,253/0/479,254/0/479,255/0/479,256/0/479,257/0/479,258/0/479,259/0/479,260/0/479,261/0/479,262/0/479,263/0/479,264/0/479,265/0/479,266/0/479,267/0/479,268/0/479,269/0/479,270/0/479,271/0/479,272/0/479,273/0/479,274/0/479,275/0/479,276/0/479,277/0/479,278/0/479,279/0/479,280/0/479,281/0/479,282/0/479,283/0/479,284/0/479,285/0/479,286/4/475,287/4/475,288/4/475,289/4/475,290/4/475,291/4/475,292/4/475,293/4/475,294/4/475,295/4/475,296/4/475,297/4/475,298/4/475,299/4/475,300/4/475,301/4/475,302/4/475,303/4/475,304/8/471,305/8/471,306/8/471,307/8/471,308/8/471,309/8/471,310/8/471,311/8/471,312/8/471,313/8/471,314/8/471,315/8/471,316/8/471,317/12/467,318/12/467,319/12/467,320/12/467,321/12/467,322/12/467,323/12/467,324/12/467,325/12/467,326/12/467,327/12/467,328/12/467,329/16/463,330/16/463,331/16/463,332/16/463,333/16/463,334/16/463,335/16/463,336/16/463,337/16/463,338/16/463,339/20/459,340/20/459,341/20/459,342/20/459,343/20/459,344/20/459,345/20/459,346/20/459,347/24/455,348/24/455,349/24/455,350/24/455,351/24/455,352/24/455,353/24/455,354/24/455,355/28/451,356/28/451,357/28/451,358/28/451,359/28/451,360/28/451,361/28/451,362/32/447,363/32/447,364/32/447,365/32/447,366/32/447,367/32/447,368/32/447,369/36/443,370/36/443,371/36/443,372/36/443,373/36/443,374/36/443,375/40/439,376/40/439,377/40/439,378/40/439,379/40/439,380/44/435,381/44/435,382/44/435,383/44/435,384/44/435,385/44/435,386/48/431,387/48/431,388/48/431,389/48/431,390/48/431,391/52/427,392/52/427,393/52/427,394/52/427,395/52/427,396/56/423,397/56/423,398/56/423,399/56/423,400/56/423,401/56/423,402/56/423,403/60/419,404/60/419,405/60/419,406/60/419,407/64/415,408/64/415,409/64/415,410/64/415,411/68/411,412/68/411,413/68/411,414/68/411,415/72/407,416/72/407,417/72/407,418/76/403,419/76/403,420/76/403,421/76/403,422/80/399,423/80/399,424/80/399,425/84/395,426/84/395,427/84/395,428/84/395,429/88/391,430/88/391,431/88/391,432/92/387,433/92/387,434/92/387,435/96/383,436/96/383,437/96/383,438/100/379,439/100/379,440/104/375,441/104/375,442/104/375,443/108/371,444/108/371,445/112/367,446/112/367,447/112/367,448/116/363,449/116/363,450/120/359,451/120/359,452/124/355,453/124/355,454/128/351,455/128/351,456/132/347,457/132/347,458/136/343,459/136/343,460/140/339,461/140/339,462/144/335,463/148/331,464/148/331,465/152/327,466/156/323,467/156/323,468/160/319,469/164/315,470/168/311,471/168/311,472/172/307,473/176/303,474/180/299,475/184/295,476/188/291,477/196/283,478/200/279,479/208/271,480/216/263,
GFXMMU.IPParameters=Buf0Address,Buf1Address,GFXMMU_AHB_MASTER_ERROR_IT,GFXMMU_BUFFER0_OVERFLOW_IT,GFXMMU_BUFFER1_OVERFLOW_IT,CacheActivation,GFXMMUtable
GPIO.groupedBy=Expand Peripherals
KeepUserPlacement=false
LTDC.ActiveH=481
LTDC.ActiveW=480
LTDC.Alpha0_L0=0
LTDC.Alpha_L0=0xFF
LTDC.FBStartAdress_L0=LCD_FRAME_BUFFER
LTDC.HBP=1
LTDC.HFP=1
LTDC.HSPolarity=LTDC_HSPOLARITY_AH
LTDC.HSync=2
LTDC.IPParameters=Layers,WindowX1_L0,WindowY0_L0,WindowY1_L0,Alpha0_L0,ImageHeight_L0,ImageWidth_L0,HSync,HBP,ActiveW,HSPolarity,VSPolarity,WindowX0_L0,FBStartAdress_L0,HFP,VSync,VBP,ActiveH,VFP,Alpha_L0
LTDC.IPParametersWithoutCheck=WindowX1_L0,WindowY0_L0,WindowY1_L0,ImageHeight_L0
LTDC.ImageHeight_L0=LCD_HEIGHT
LTDC.ImageWidth_L0=LCD_WIDTH
LTDC.Layers=0
LTDC.VBP=12
LTDC.VFP=50
LTDC.VSPolarity=LTDC_VSPOLARITY_AH
LTDC.VSync=1
LTDC.WindowX0_L0=0
LTDC.WindowX1_L0=LCD_WIDTH
LTDC.WindowY0_L0=0
LTDC.WindowY1_L0=LCD_HEIGHT
MMTAppReg1.MEMORYMAP.AP=RW_priv_only
MMTAppReg1.MEMORYMAP.AppRegionName=RAM
MMTAppReg1.MEMORYMAP.ContextName=CortexM33
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,AP
MMTAppReg1.MEMORYMAP.Name=RAM
MMTAppReg1.MEMORYMAP.Size=2555904
MMTAppReg1.MEMORYMAP.StartAddress=0x20000000
MMTAppReg2.MEMORYMAP.AppRegionName=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg2.MEMORYMAP.DefaultDataRegion=false
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg2.MEMORYMAP.Name=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.ReservedRegion=true
MMTAppReg2.MEMORYMAP.Size=2555904
MMTAppReg2.MEMORYMAP.StartAddress=0x0A000000
MMTAppReg3.MEMORYMAP.AP=RO_priv_only
MMTAppReg3.MEMORYMAP.AppRegionName=FLASH
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=CortexM33
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg3.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg3.MEMORYMAP.MemType=ROM
MMTAppReg3.MEMORYMAP.Name=FLASH
MMTAppReg3.MEMORYMAP.Size=4194304
MMTAppReg3.MEMORYMAP.StartAddress=0x08000000
MMTAppRegionsCount=3
MMTConfigApplied=false
Mcu.CPN=STM32U5A9NJH6Q
Mcu.ContextProject=TrustZoneDisabled
Mcu.Family=STM32U5
Mcu.IP0=CORTEX_M33_NS
Mcu.IP1=DMA2D
Mcu.IP10=RCC
Mcu.IP11=SYS
Mcu.IP2=DSIHOST
Mcu.IP3=GFXMMU
Mcu.IP4=ICACHE
Mcu.IP5=LPBAMQUEUE
Mcu.IP6=LTDC
Mcu.IP7=MEMORYMAP
Mcu.IP8=NVIC
Mcu.IP9=PWR
Mcu.IPNb=12
Mcu.Name=STM32U5A9NJHxQ
Mcu.Package=TFBGA216
Mcu.Pin0=PD5
Mcu.Pin1=PI6
Mcu.Pin10=VP_DMA2D_VS_DMA2D
Mcu.Pin11=VP_GFXMMU_VS_GFXMMU
Mcu.Pin12=VP_ICACHE_VS_ICACHE
Mcu.Pin13=VP_LPBAMQUEUE_VS_QUEUE
Mcu.Pin14=VP_LTDC_DSIMode
Mcu.Pin15=VP_PWR_VS_DBSignals
Mcu.Pin16=VP_PWR_VS_SECSignals
Mcu.Pin17=VP_PWR_VS_LPOM
Mcu.Pin18=VP_SYS_VS_tim2
Mcu.Pin19=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin2=DSI_D0P
Mcu.Pin20=VP_STMicroelectronics.X-CUBE-FREERTOS_VS_CMSISJjRTOS2_10.6.2_1.3.1
Mcu.Pin3=DSI_D0N
Mcu.Pin4=DSI_CKP
Mcu.Pin5=DSI_CKN
Mcu.Pin6=DSI_D1N
Mcu.Pin7=DSI_D1P
Mcu.Pin8=PH0-OSC_IN (PH0)
Mcu.Pin9=PH1-OSC_OUT (PH1)
Mcu.PinsNb=21
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-FREERTOS.1.3.1
Mcu.ThirdPartyNb=1
Mcu.UserConstants=VFP,50;LCD_WIDTH,480;VBP,12;LCD_FRAME_BUFFER,0x200D0000;HACT,480;VSYNC,1;HFP,1;VACT,481;IMAGE_HEIGHT,240;HBP,1;IMAGE_WIDTH,320;LCD_HEIGHT,481;HSYNC,2
Mcu.UserName=STM32U5A9NJHxQ
MxCube.Version=6.15.0
MxDb.Version=DB.6.0.150
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.DMA2D_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.DSI_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.LTDC_ER_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC.SavedPendsvIrqHandlerGenerated=true
NVIC.SavedSvcallIrqHandlerGenerated=true
NVIC.SavedSystickIrqHandlerGenerated=true
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true\:false
NVIC.TIM2_IRQn=true\:15\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TimeBase=TIM2_IRQn
NVIC.TimeBaseIP=TIM2
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
PD5.GPIOParameters=GPIO_Speed,GPIO_PuPd
PD5.GPIO_PuPd=GPIO_PULLDOWN
PD5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD5.Locked=true
PD5.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PI6.GPIOParameters=GPIO_PuPd
PI6.GPIO_PuPd=GPIO_PULLUP
PI6.Locked=true
PI6.Signal=GPIO_Input
PWR.IPParameters=PowerMode
PWR.PowerMode=PWR_SMPS_SUPPLY
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=true
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=false
ProjectManager.DeviceId=STM32U5A9NJHxQ
ProjectManager.Example=DSI_VideoMode_SingleBuffer
ProjectManager.ExampleSource=CubeFw
ProjectManager.FirmwarePackage=STM32Cube FW_U5 V1.8.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x600
ProjectManager.KeepUserCode=true
ProjectManager.LPBAM.generateCode=
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=u5a9_lvgl.ioc
ProjectManager.ProjectName=u5a9_lvgl
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x2000
ProjectManager.TargetToolchain=CMake
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_DMA2D_Init-DMA2D-false-HAL-true,4-MX_ICACHE_Init-ICACHE-false-HAL-true,5-MX_DSIHOST_DSI_Init-DSIHOST-false-HAL-true,6-MX_LTDC_Init-LTDC-false-HAL-true,7-MX_GFXMMU_Init-GFXMMU-false-HAL-true,0-MX_CORTEX_M33_NS_Init-CORTEX_M33_NS-false-HAL-true,0-MX_PWR_Init-PWR-false-HAL-true
RCC.ADCFreq_Value=16000000
RCC.ADF1Freq_Value=160000000
RCC.AHBFreq_Value=160000000
RCC.APB1Freq_Value=160000000
RCC.APB1TimFreq_Value=160000000
RCC.APB2Freq_Value=160000000
RCC.APB2TimFreq_Value=160000000
RCC.APB3Freq_Value=160000000
RCC.CK48Freq_Value=48000000
RCC.CRSFreq_Value=48000000
RCC.CortexFreq_Value=160000000
RCC.DACCLockSelectionVirtual=RCC_DAC1CLKSOURCE_LSI
RCC.DACFreq_Value=32000
RCC.DSICLockSelection=RCC_DSICLKSOURCE_PLL3
RCC.DSIFreq_Value=62500000
RCC.DSITXEscFreq_Value=15625000
RCC.EPOD_VALUE=4000000
RCC.FCLKCortexFreq_Value=160000000
RCC.FDCANFreq_Value=160000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=160000000
RCC.HSE_VALUE=16000000
RCC.HSI48_VALUE=48000000
RCC.HSI_VALUE=16000000
RCC.HSPI1Freq_Value=160000000
RCC.I2C1Freq_Value=160000000
RCC.I2C2Freq_Value=160000000
RCC.I2C3Freq_Value=160000000
RCC.I2C4Freq_Value=160000000
RCC.I2C5Freq_Value=160000000
RCC.I2C6Freq_Value=160000000
RCC.IPParameters=ADCFreq_Value,ADF1Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,CK48Freq_Value,CRSFreq_Value,CortexFreq_Value,DACCLockSelectionVirtual,DACFreq_Value,DSICLockSelection,DSIFreq_Value,DSITXEscFreq_Value,EPOD_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,HSPI1Freq_Value,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2C5Freq_Value,I2C6Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSIDIV_VALUE,LSI_VALUE,LTDCCLockSelection,LTDCFreq_Value,MCO1PinFreq_Value,MDF1Freq_Value,MSI_VALUE,OCTOSPIMFreq_Value,PLL2M,PLL2N,PLL2PoutputFreq_Value,PLL2QoutputFreq_Value,PLL2R,PLL2RoutputFreq_Value,PLL2Source,PLL3M,PLL3N,PLL3P,PLL3PoutputFreq_Value,PLL3QoutputFreq_Value,PLL3R,PLL3RoutputFreq_Value,PLL3Source,PLLDSIFreq_Value,PLLDSIIDF,PLLDSINDIV,PLLDSIODF,PLLDSIVCOFreq_Value,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,RNGFreq_Value,SAESFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SPI1Freq_Value,SPI2Freq_Value,SPI3Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBPHYFreq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOPLL2OutputFreq_Value,VCOPLL3OutputFreq_Value
RCC.LPTIM2Freq_Value=160000000
RCC.LPUART1Freq_Value=160000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSIDIV_VALUE=32000
RCC.LSI_VALUE=32000
RCC.LTDCCLockSelection=RCC_LTDCCLKSOURCE_PLL3
RCC.LTDCFreq_Value=20833333.333333332
RCC.MCO1PinFreq_Value=160000000
RCC.MDF1Freq_Value=160000000
RCC.MSI_VALUE=4000000
RCC.OCTOSPIMFreq_Value=160000000
RCC.PLL2M=4
RCC.PLL2N=125
RCC.PLL2PoutputFreq_Value=250000000
RCC.PLL2QoutputFreq_Value=250000000
RCC.PLL2R=24
RCC.PLL2RoutputFreq_Value=20833333.333333332
RCC.PLL2Source=RCC_PLLSOURCE_HSE
RCC.PLL3M=4
RCC.PLL3N=125
RCC.PLL3P=8
RCC.PLL3PoutputFreq_Value=62500000
RCC.PLL3QoutputFreq_Value=250000000
RCC.PLL3R=24
RCC.PLL3RoutputFreq_Value=20833333.333333332
RCC.PLL3Source=RCC_PLLSOURCE_HSE
RCC.PLLDSIFreq_Value=500000000
RCC.PLLDSIIDF=DSI_PLL_IN_DIV4
RCC.PLLDSINDIV=125
RCC.PLLDSIODF=DSI_PLL_OUT_DIV2
RCC.PLLDSIVCOFreq_Value=1000000000
RCC.PLLN=80
RCC.PLLPoutputFreq_Value=160000000
RCC.PLLQoutputFreq_Value=160000000
RCC.PLLRCLKFreq_Value=160000000
RCC.RNGFreq_Value=48000000
RCC.SAESFreq_Value=48000000
RCC.SAI1Freq_Value=250000000
RCC.SAI2Freq_Value=250000000
RCC.SDMMCFreq_Value=160000000
RCC.SPI1Freq_Value=160000000
RCC.SPI2Freq_Value=160000000
RCC.SPI3Freq_Value=160000000
RCC.SYSCLKFreq_VALUE=160000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.UART4Freq_Value=160000000
RCC.UART5Freq_Value=160000000
RCC.USART1Freq_Value=160000000
RCC.USART2Freq_Value=160000000
RCC.USART3Freq_Value=160000000
RCC.USART6Freq_Value=160000000
RCC.USBPHYFreq_Value=160000000
RCC.VCOInput2Freq_Value=4000000
RCC.VCOInput3Freq_Value=4000000
RCC.VCOInputFreq_Value=4000000
RCC.VCOOutputFreq_Value=320000000
RCC.VCOPLL2OutputFreq_Value=500000000
